---
title: PolylineSegments
classe: Autodesk.Revit.DB.PolylineSegments
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PolylineSegments

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double EndLocalParameter { get; }` | `polylineSegments.EndLocalParameter` | Double |
| `Double EndParameter { get; }` | `polylineSegments.EndParameter` | Double |
| `Boolean IsFilled { get; }` | `polylineSegments.IsFilled` | Boolean |
| `Boolean IsValidObject { get; }` | `polylineSegments.IsValidObject` | Boolean |
| `LineProperties LineProperties { get; }` | `polylineSegments.LineProperties` | LineProperties |
| `Double StartLocalParameter { get; }` | `polylineSegments.StartLocalParameter` | Double |
| `Double StartParameter { get; }` | `polylineSegments.StartParameter` | Double |
| `Void Dispose()` | `polylineSegments.Dispose()` | Void |
| `IList<XYZ> GetVertices()` | `polylineSegments.GetVertices()` | IList<XYZ> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```